In [167]:
import numpy as np
import pandas as pd

In [168]:
data = np.random.randn(4,3)

In [169]:
data

array([[ 0.92152839, -0.90737954,  0.90474359],
       [ 1.66558393, -0.37116618, -0.03163904],
       [ 0.25679763,  0.33073517, -2.42510536],
       [-0.47741205,  0.66727037, -0.44814405]])

In [170]:
dataframe = pd.DataFrame(data)

In [171]:
type(dataframe)

pandas.core.frame.DataFrame

In [172]:
dataframe

          0         1         2
0  0.921528 -0.907380  0.904744
1  1.665584 -0.371166 -0.031639
2  0.256798  0.330735 -2.425105
3 -0.477412  0.667270 -0.448144

In [173]:
yenidataframe = pd.DataFrame(data, index= ["ismail","atil","atlas","mehmet"],columns= ["maas","yas","calisma saati"])

In [174]:
yenidataframe

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [175]:
yenidataframe[ "yas"]

ismail   -0.907380
atil     -0.371166
atlas     0.330735
mehmet    0.667270
Name: yas, dtype: float64

In [176]:
yenidataframe["calisma saati"]

ismail    0.904744
atil     -0.031639
atlas    -2.425105
mehmet   -0.448144
Name: calisma saati, dtype: float64

In [177]:
yenidataframe[["maas","yas"]]

            maas       yas
ismail  0.921528 -0.907380
atil    1.665584 -0.371166
atlas   0.256798  0.330735
mehmet -0.477412  0.667270

In [178]:
yenidataframe.loc["atil"]

maas             1.665584
yas             -0.371166
calisma saati   -0.031639
Name: atil, dtype: float64

In [179]:
yenidataframe.loc["ismail"]

maas             0.921528
yas             -0.907380
calisma saati    0.904744
Name: ismail, dtype: float64

In [180]:
yenidataframe.iloc[1]

maas             1.665584
yas             -0.371166
calisma saati   -0.031639
Name: atil, dtype: float64

In [181]:
yenidataframe

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [182]:
yenidataframe["maas"]

ismail    0.921528
atil      1.665584
atlas     0.256798
mehmet   -0.477412
Name: maas, dtype: float64

In [183]:
yenidataframe["emeklilik yasi"] = yenidataframe["yas"] +yenidataframe["yas"]

In [184]:
yenidataframe

            maas       yas  calisma saati  emeklilik yasi
ismail  0.921528 -0.907380       0.904744       -1.814759
atil    1.665584 -0.371166      -0.031639       -0.742332
atlas   0.256798  0.330735      -2.425105        0.661470
mehmet -0.477412  0.667270      -0.448144        1.334541

In [185]:
yenidataframe.drop("emeklilik yasi", axis = 1)

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [186]:
yenidataframe.drop("mehmet", axis = 0)

            maas       yas  calisma saati  emeklilik yasi
ismail  0.921528 -0.907380       0.904744       -1.814759
atil    1.665584 -0.371166      -0.031639       -0.742332
atlas   0.256798  0.330735      -2.425105        0.661470

In [187]:
yenidataframe

            maas       yas  calisma saati  emeklilik yasi
ismail  0.921528 -0.907380       0.904744       -1.814759
atil    1.665584 -0.371166      -0.031639       -0.742332
atlas   0.256798  0.330735      -2.425105        0.661470
mehmet -0.477412  0.667270      -0.448144        1.334541

In [188]:
yenidataframe.drop("emeklilik yasi", axis = 1, inplace = True)

In [189]:
yenidataframe

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [190]:
yenidataframe.loc["atil"]["maas"]

1.6655839320534342

In [191]:
yenidataframe.loc["atlas","yas"]

0.3307351688741242

In [192]:
yenidataframe

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [193]:
booleanFream= yenidataframe <0

In [194]:
booleanFream

         maas    yas  calisma saati
ismail  False   True          False
atil    False   True           True
atlas   False  False           True
mehmet   True  False           True

In [195]:
yenidataframe[booleanFream]

            maas       yas  calisma saati
ismail       NaN -0.907380            NaN
atil         NaN -0.371166      -0.031639
atlas        NaN       NaN      -2.425105
mehmet -0.477412       NaN      -0.448144

In [196]:
yenidataframe[yenidataframe < 0]

            maas       yas  calisma saati
ismail       NaN -0.907380            NaN
atil         NaN -0.371166      -0.031639
atlas        NaN       NaN      -2.425105
mehmet -0.477412       NaN      -0.448144

In [197]:
yenidataframe[yenidataframe["yas"] >0 ]

            maas       yas  calisma saati
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [198]:
yenidataframe

            maas       yas  calisma saati
ismail  0.921528 -0.907380       0.904744
atil    1.665584 -0.371166      -0.031639
atlas   0.256798  0.330735      -2.425105
mehmet -0.477412  0.667270      -0.448144

In [199]:
yenidataframe.reset_index()

    index      maas       yas  calisma saati
0  ismail  0.921528 -0.907380       0.904744
1    atil  1.665584 -0.371166      -0.031639
2   atlas  0.256798  0.330735      -2.425105
3  mehmet -0.477412  0.667270      -0.448144

In [200]:
yeniindexlistesi = ["ism","ati", "atl", "meh"]

In [201]:
yenidataframe["yeni index"]= yeniindexlistesi

In [202]:
yenidataframe

            maas       yas  calisma saati yeni index
ismail  0.921528 -0.907380       0.904744        ism
atil    1.665584 -0.371166      -0.031639        ati
atlas   0.256798  0.330735      -2.425105        atl
mehmet -0.477412  0.667270      -0.448144        meh

In [203]:
yenidataframe.set_index("yeni index")

                maas       yas  calisma saati
yeni index
ism         0.921528 -0.907380       0.904744
ati         1.665584 -0.371166      -0.031639
atl         0.256798  0.330735      -2.425105
meh        -0.477412  0.667270      -0.448144

In [204]:
yenidataframe.set_index("yeni index",inplace = True)

In [205]:
yenidataframe

                maas       yas  calisma saati
yeni index
ism         0.921528 -0.907380       0.904744
ati         1.665584 -0.371166      -0.031639
atl         0.256798  0.330735      -2.425105
meh        -0.477412  0.667270      -0.448144

In [206]:
yenidataframe.loc["ism"]

maas             0.921528
yas             -0.907380
calisma saati    0.904744
Name: ism, dtype: float64

In [207]:
ilkindexler = ["simpson","simpson","simpson","south park","south park","south park"]

In [208]:
icindexler =["homer","bart","marge","cartman","kenny","kyle"]

In [209]:
birlesmisindeks= list(zip(ilkindexler,icindexler))

In [210]:
birlesmisindeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [214]:
birlesmisindeks = pd.MultiIndex.from_tuples(birlesmisindeks)

In [215]:
birlesmisindeks

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [220]:
benimcizgifilimlistem = [[40,"a"],[10,"b"],[30,"c"],[9,"d"],[10,"e"],[11,"f"]]

In [221]:
cizgifilmnumpydizisi = np.array(benimcizgifilimlistem)

In [222]:
cizgifiilmdataframe = pd.DataFrame(cizgifilmnumpydizisi ,index =birlesmisindeks,columns =["yas","meslek"])

In [223]:
cizgifiilmdataframe

                   yas meslek
simpson    homer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f

In [224]:
cizgifiilmdataframe.loc["simpson"]

      yas meslek
homer  40      a
bart   10      b
marge  30      c

In [226]:
cizgifiilmdataframe.loc["south park"].loc["kenny"]

yas       10
meslek     e
Name: kenny, dtype: object

In [227]:
cizgifiilmdataframe

                   yas meslek
simpson    homer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f

In [228]:
cizgifiilmdataframe.index.names = ["film adi","isim"]

In [229]:
cizgifiilmdataframe

                   yas meslek
film adi   isim
simpson    homer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f